       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLOSAMPLE.
       ENVIRONMENT DIVISION. 
       PROCEDURE DIVISION.
           DISPLAY 'HELLO WORLD'
           STOP RUN.
       END PROGRAM HELLOSAMPLE.
